<?php 
//Задача №1

echo (24*60*60).'<br>';

//Задача №2
echo (30*24*60*60).'<br>';

//Задача №3
echo (365*24*60*60).'<br>';

//Задача №4
echo (24*60).'<br>';

//Задача №5
echo (365*24*60).'<br>';

//Задача №6
echo (1024*1024).'<br>';

//Задача №7
echo (1024*1024*1024).'<br>';

//Задача №8
echo (1024*1024*1024*10).'<br>';

//Задача №9
echo (1024*1024*1024*1024).'<br>';

//Задача №10
echo (1024*1024*1024).'<br>';

//Задача №11
$r =  123;

$s = M_PI*$r**2;
echo $s.'<br>';

//Задача №12
$a =  321;

$s = $a**2;
echo $s.'<br>';

//Задача №13
$a = 321;
$b = 765;

$s = $a*$b;
echo $s.'<br>';


//Задача №14
$a = 321;
$b = 765;

$p = 2*($a+$b);
echo $p.'<br>';

//Задача №15
$ts = 34;

echo ($ts*9/5+32).'<br>';

//Задача №16
$ts = 34;

echo (($ts-32)*5/9).'<br>';

?>