<?php 

// Задача №1
$a= 1+2+3;

echo $a ."\n";


// Задача №2
echo 1+2+3;
echo "\n";


// Задача №3
$a = 10;
$b = 2;

echo $a+$b ."\n";
echo $a-$b ."\n";
echo $a*$b ."\n";
echo $a/$b ."\n";


// Задача №4
$c = 10;
$d = 5;
$result = $c + $d;

echo $result."\n";

// Задача №5
$a = 1;
$b = 2;
$c = 3;

echo $a+$b+$c ."\n";

// Задача №6
$a = 10;
$b = 5;
$c = $a - $b;

$d = 7;
$result = $c + $d;

echo $result ."\n";


// Задача №7
$a = 5 + 5*3;//20
echo $a ."\n";


// Задача №8
$a = 5+5*3 +3;//23
echo $a ."\n";


// Задача №9
$a = 8/2+2;//6
echo $a ."\n";


// Задача №10
$a = 8+2/2;//9
echo $a ."\n"; 


// Задача №11
$a = 8/2*2;//8
echo $a ."\n";


// Задача №12
$a = 8*4/2/2;//8
echo $a ."\n"; 

// Задача №13
$a = (2+3)*(2+3);//25
echo $a ."\n"; 


// Задача №14
$a = (2+3)*2+3;//13
echo $a ."\n";


// Задача №15
$a = 2*(2+4*(3+1));//36
echo $a ."\n"; 


// Задача №16
$a = 2*8/4;//4
echo $a ."\n"; 


// Задача №17
$a = (2*8)/4;//4
echo $a ."\n"; 


// Задача №18
$a = 2*(8/4);//4
echo $a ."\n"; 


// Задача №19
$a = 1.5;
$b = 0.75;

echo $a + $b ."\n"; 


// Задача №20
$a = -100;

echo $a ."\n"; 


// Задача №21
$a = 67576;

echo -$a ."\n"; 


// Задача №22
$a = 10;
$b = 3;

echo $a%$b ."\n"; 


// Задача №23

echo 2**10 ."\n"; 



// Задача №24
$a = 3*2**3;//24
echo $a ."\n"; 


// Задача №25
$a = (3*2)**3;//216
echo $a ."\n"; 


// Задача №26
$a = 3*2**(3+1);//48

echo $a ."\n"; 



// Задача №27
$a = 2**3*3;//24
echo $a ."\n"; 


// Задача №28
$a = 3*2**3*3;//72
echo $a ."\n"; 
?>


<h2>Задача №28</h2>
<?php
// Задача №28
$a = 3*2**3*3;//72
echo $a ."\n"; 
?>
