<?php 
//Задача №1

echo '<i>курсивный текст</i>'.'<br>';

//Задача №2
for( $i = 1; $i < 10; $i++ ){
  echo $i.'<br>';
};

//Задача №3
echo '<img src="https://arthive.net/res/media/img/oy1200/work/12b/200969.webp" alt="malevich" width="50" height="50">'.'<br>';

//Задача №4
echo '<input type="text" id="uname" name="name"
      placeholder="какой-нибудь текст"
           size="30">'.'<br>';

//Задача №5
echo '<textarea id="area" name="area" rows="8" cols="50">
Не то чтобы Мокрицу не нравилась новая жизнь – он привык находить выход из любой ситуации и из любого города, даже такого, как Анк-Морпорк. Ему скорее пришлась не по душе должность Главного Почтмейстера. Мокриц фон Липвиг – приличный мошенник, в конце концов, и слово «работа» – точно не про него! Но разве есть выбор у человека, чьим персональным ангелом 
</textarea>'.'<br>';

?>

